Repository: RODRIG0RIVAS/spending_awareness
Catalog: lib/l10n/intl_*.arb
Languages: pt

# lbl_title
source: Spending Awareness
pt: Conscientizador de gastos

# lbl_selectReceiptMethod
source: Select your salary receipt method
pt: Você recebe por?

# lbl_putYourSalaryHere
source: Put your salary here
pt: Coloque seu salário abaixo

# lbl_changeTimeWorth
source: Change your time worth
pt: Mude o valor do tempo

# lbl_changeTimeWorthContent
source: You have to update how much do your time worth!
pt: É necessário atualizar o quanto seu tempo vale!

# lbl_addTimeWorth
source: Add your time worth
pt: Adicione o valor do tempo

# lbl_addTimeWorthContent
source: It is necessary to calculate how much your time is worth. On the next screen, you added how many hours and how many days you work. This process is necessary to use all the functions of the application.
pt: É necessário calcular quanto seu tempo vale. Na próxima tela, você adicionará quantas horas e por quantos dias você trabalha. Este processo é necessário para usar todas as funções do aplicativo.

# lbl_getAwarenessOf
source: I want to get awareness of:
pt: Eu quero me conscientizar de:

# lbl_iReceive
source: I receive
pt: Eu recebo

# lbl_aMonth
source: a month
pt: por mês

# lbl_aWeek
source: a week
pt: por semana

# lbl_yourYearWorth
source: Your year worth
pt: Seu ano vale

# lbl_yourDayWorth
source: Your day worth
pt: Seu dia vale

# lbl_yourHourWorth
source: Your hour worth
pt: Sua hora vale

# lbl_howManyHoursWorkAday
source: How many hours do you work a day?
pt: Quantas horas você trabalha por dia?

# lbl_forHowManydaysInAmonth
source: For how many days in a month?
pt: Por quantos dias no mês?

# lbl_forHowManyDaysInAweek
source: For how many days in a week?
pt: Por quantos dias na semana?

# lbl_youWorkForXhoursA
source: You work for {period} hours a
pt: {period} horas trabalhadas por

# lbl_month
source: month
pt: mês

# lbl_week
source: week
pt: semana

# lbl_worthToBuy
source: Worth to buy?
pt: Vale a pena comprar?

# lbl_howMuchTheItemCosts
source: How much the item costs?
pt: Quanto o produto ou serviço custa?

# lbl_howManyTimesAweekDoYouBuyIt
source: How many times a week do you buy it
pt: Em quantas vezes na semana você gasta com isso?

# lbl_toBuyItOnceYouHaveToWork
source: To buy it once, you have to work
pt: Compre uma vez e trabalhe por

# lbl_hour
source: hour
pt: hora

# lbl_minute
source: minute
pt: minuto

# lbl_day
source: day
pt: dia

# lbl_and
source: and
pt: e

# lbl_or
source: or
pt: ou

# lbl_impactOfCreditCardInstallment
source: Impact of credit card installments
pt: Impacto do cartão de crédito

# lbl_howMuchOneInstallmentCosts
source: How much a installment costs?
pt: Qual o valor de uma parcela?

# lbl_inHowManyInstallments
source: How many installments?
pt: Quantas são?

# lbl_realSalaryInNextMonth
source: Real salary in next month
pt: Salário real no próximo mês

# lbl_totalInstallmentCost
source: Total installment cost
pt: Custo total do parcelamento

# lbl_toBuyItAtTotalValueYouHaveToWork
source: To buy at full value, work for
pt: Tempo de trabalho para pagar

# lbl_youSpendInAweek
source: You spend in a week
pt: Você gasta, por semana

# lbl_welcome_screen_propose_explanation
source: This is an app for get some awareness about your own spending, it will show you how many money you spend exponentially.
pt: Esse é o aplicativo para ter alguma noção sobre seus próprios gastos, isto mostrará o quanto de dinheiro você gasta, ou vai gastar, exponencialmente.

# lbl_welcome_screen_spending_awareness
source: Welcome to spending awareness
pt: Bem vindo

# lbl_choice_your_earn_type
source: Choose how you earn your salary
pt: Selecione como você recebe o salário

# lbl_get_type
source: You can choose Weekly or Monthly.
pt: Você pode escolher semanalmente ou mensalmente.

# lbl_add_money
source: Add how much you get
pt: Adicione quanto você recebe

# lbl_add_money_explanation
source: and click ok
pt: e clique em ok

# lbl_knowYourMoneyWorth
source: Know your money's worth
pt: Saiba o valor do seu dinheiro

# lbl_clickTheButtonAboveToContinue
source: Click the button above to continue
pt: Clique no botão acima para continuar

# lbl_swipe
source: Swipe
pt: Deslize

# lbl_introductionExplanationTitleAlertDialog
source: Explanation
pt: Explicação

# lbl_eachButtonFunctionality
source: Do you want to know the functionality of each button?
pt: Tutorial dos botões

# lbl_firstButtonExplanation
source: As already seen. Here it is calculated how much your time is worth. Just add how many hours and how many days you work. This step is necessary to use all the functions of the app.
pt: Como já foi visto. Aqui é calculado quanto o seu tempo vale. Apenas adicione quantas horas e por quantos dias você trabalha. Este passo é necessário pra usar todas as funções do app.

# lbl_secondButtonExplanation
source: Is it worth it or not to buy it? How long will I have to work to buy this? Have the answer in this function.
pt: Vale a pena ou não comprar isso? Quanto tempo eu vou ter de trabalhar pra comprar isso? Tenha a resposta nesta função.

# lbl_thirdButtonExplanation
source: Find out how much an installment weighs on your entire salary, which in fact, with installments is no longer whole.
pt: Tenha noção do quanto um parcelamento pesa no seu salário inteiro, que na verdade, com parcelamento não é mais inteiro.

# lbl_fourthButtonExplanation
source: If your salary changes, or is now receiving it in another way that is monthly or weekly, just change it here.
pt: Caso seu salário mude, ou agora esteja recebendo de uma outra forma que seja mensal ou semanal, apenas mude aqui.

# lbl_next
source: Next
pt: Próximo

# lbl_continue
source: Continue
pt: Continuar

# btn_toogle_selectReceiptMethod_week
source: Week
pt: Semana

# btn_toogle_selectReceiptMethod_month
source: Month
pt: Mês

# btn_timeValue
source: How much my time worth
pt: Quanto vale o meu tempo

# btn_worthToBuy
source: Worth to buy it?
pt: Vale a pena comprar?

# btn_creditCartImpact
source: Credit card impact
pt: Impacto do cartão de crédito

# btn_changeSalary
source: Change salary
pt: Mudar salário

# btn_save
source: Save
pt: Salvar

# answer_insertAnyValue
source: Insert any value
pt: Insira algum valor

# answer_onlyNumbers
source: Only numbers can be used here
pt: Apenas números podem ser usados aqui

# answer_youCanUseItWhenSetYourTimeValue
source: You can use it when set your time value
pt: Você pode usar isso depois de medir quanto vale o seu tempo

# answer_setFollowingValues
source: Please, set the values to continue
pt: Por favor, coloque os valores para continuar
